In [3]:
import pandas as pd
data= pd.read_csv("titanic.csv")

In [5]:
data.groupby("Sex")

In [6]:
data.groupby("Sex").count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577

In [7]:
data.groupby("Sex").mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [8]:
data.groupby("Sex").mean()["Age"]

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [9]:
data[["Age", "Sex"]].groupby("Sex").mean()

              Age
Sex
female  27.915709
male    30.726645

In [10]:
data.groupby("Sex")["Age"].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [11]:
data[["Age", "Pclass"]].groupby("Pclass").max()

         Age
Pclass
1       80.0
2       70.0
3       74.0

In [12]:
data.groupby("Survived").count()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Survived,,,,,,,,,,,
0,549,549,549,549,424,549,549,549,549,68,549
1,342,342,342,342,290,342,342,342,342,136,340

In [13]:
data.groupby("Survived").size()

Survived
0    549
1    342
dtype: int64

In [14]:
data[["Age", "Pclass"]].groupby("Pclass").agg(["min", "max", "mean", "std"])

         Age
         min   max       mean        std
Pclass
1       0.92  80.0  38.233441  14.802856
2       0.67  70.0  29.877630  14.001077
3       0.42  74.0  25.140620  12.495398

In [16]:
data[["Pclass", "Sex", "Age"]].groupby(["Pclass", "Sex"]).mean()

                     Age
Pclass Sex
1      female  34.611765
       male    41.281386
2      female  28.722973
       male    30.740707
3      female  21.750000
       male    26.507589

In [17]:
data[["Pclass", "Sex", "Survived"]].groupby(["Pclass", "Sex"]).mean()

               Survived
Pclass Sex
1      female  0.968085
       male    0.368852
2      female  0.921053
       male    0.157407
3      female  0.500000
       male    0.135447